cases/flowThroughMass/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        // No nitrogen at the entrance (pure oxygen)
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    outlet
    {
        // Pure nitrogen at the exit
        type            fixedValue;
        value           uniform 1.0;
    }


    top
    {
        // Impermeable boundary
        type              zeroGradient;
    }

    bottom
    {
        // Impermeable boundary
        type              zeroGradient;
    }

    front
    {
        // Impermeable boundary
        type              zeroGradient;
    }

    back
    {
        // Impermeable boundary
        type              zeroGradient;
    }
}


// ************************************************************************* //
