cases/flowThroughMass/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    outlet
    {
        // No nitrogen at the exit (pure oxygen)
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }

    top
    {
        // Impermeable boundary
        type              zeroGradient;
    }

    bottom
    {
        // Impermeable boundary
        type              zeroGradient;
    }

    front
    {
        // Impermeable boundary
        type              zeroGradient;
    }

    back
    {
        // Impermeable boundary
        type              zeroGradient;
    }
}

// ************************************************************************* //
