cases/flowThroughMass/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    // p
    // {
    //     //solver           PCG;
    //     solver           GAMG;
    //     preconditioner   DIC;
    //     tolerance        1e-6;
    //     relTol           0.1;
    // }

    p
    {
        solver GAMG;
        tolerance 1e-6;
        relTol 0.1;
        smoother DICGaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0.0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|h|k|epsilon|omega|R|nuTilda)Final"
    {
        $U;
        //tolerance       1e-05;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }

}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    //pRefCell        0;
    //pRefValue       0;
}

PISO
{
  nCorrectors 2;
  nNonOrthogonalCorrectors 0;
  pRefCell	0;
  pRefValue	0;
}


// ************************************************************************* //
